#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
int main()
{
    char *locale = setlocale(LC_ALL, "");
    double L;  // Сума кредиту
    double i;  // Відсоткова ставка
    double n;    // Термін виплати кредиту (роки)
    double I;  // Загальна сума відсотків
    double totalAmount; // Загальна сума, яку потрібно сплатити
    printf("Введіть суму кредиту (грн): ");
    if (scanf("%lf", &L), L <= 0) {
        printf("Помилка: сума кредиту повинна бути додатним числом.\n");
        return 1;
    }

    printf("Введіть відсоткову ставку (%): ");
    if (scanf("%lf", &i), i < 0) {
        printf("Помилка: відсоткова ставка повинна бути невід'ємним числом.\n");
        return 1;
    }

    printf("Введіть термін виплати кредиту (роки): ");
    if (scanf("%lf", &n), n <= 0) {
        printf("Помилка: термін виплати кредиту повинен бути додатним числом.\n");
        return 1;
    }
    // Розрахунок загальної суми відсотків за кредитом
    I = L * (i * n / 100);
    // Розрахунок загальної суми, яку потрібно буде сплатити
    totalAmount = L + I;
    printf("\nЗагальна сума відсотків за кредитом: %.2lf грн\n", I);
    printf("Загальна сума, яку потрібно буде сплатити: %.2lf грн\n", totalAmount);

    return 0;
}
